Repository: foodlz/google_map_location_picker
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, pl, pt, ru, sr, tr, uk, zh

source: Please check your connection
ar: تأكد من وجود انترنت
de: Prüfe deine Internetverbindung
es: Por favor, verifique su conexión
fr: Veuillez vérifier votre connexion
it: Controlla la tua connessione di rete
pl: Proszę sprawdzić połączenie
pt: Por favor, verifique sua conexão
ru: Пожалуйста, проверьте ваше соединение
sr: Proverite svoju internet konekciju
tr: Lütfen bağlantınızı kontrol edin
uk: Будь ласка, перевірте ваше з'єднання
zh: 请检查您的连接

source: Server error
ar: خطأ من الخادم حاول مرة اخري
de: Server Fehler
es: Error del servidor
fr: Erreur du serveur
it: Errore del server
pl: Błąd serwera
pt: Erro de servidor
ru: Ошибка сервера
sr: Greška na serveru.
tr: Sunucu hatası
uk: Помилка сервера
zh: 服务器错误

source: Access to location denied
ar: تم رفض إذن الوصل الي الموقع الجغرافي
de: Zugriff auf Standort verweigert
es: Acceso a la ubicación denegado
fr: Accès à l'emplacement refusé
it: Accesso alla posizione rifiutato
pl: Odmówiono dostępu do lokalizacji
pt: Acesso ao local negado
ru: Доступ к местоположению запрещен
sr: Onemogućen pristup lokaciji
tr: Konum erişimi reddedildi
uk: Відмовлено в доступі до місцезнаходження
zh: 访问位置被拒绝

source: Allow access to the location services.
ar: من فضلك قم بقبول إذن الوصول الي الموقع الجغرافي
de: Erlaube Zugriff auf Standort
es: Permitir acceso a los servicios de ubicación
fr: Autoriser l'accès aux services de localisation.
it: Permetti l'accesso ai servizi di localizzazione.
pl: Zezwól na dostęp do usług lokalizacyjnych.
pt: Permitir acesso aos serviços de localização.
ru: Разрешить доступ к службам определения местоположения.
sr: Omogućite pristup Vašoj lokaciji
tr: Konum servislerine izin verin.
uk: Дозвольте доступ до служб місцезнаходження.
zh: 允许访问位置服务

source: Access to location permanently denied
ar: تم رفض إذن الوصل الي الموقع الجغرافي بشكل نهائي
de: Zugriff auf Standort permanent verweigert
es: Acceso a la ubicación denegado permanentemente
fr: Accès à l'emplacement refusé définitivement
it: Accesso alla posizione rifiutato permanentemente
pl: Odmówiono dostępu do lokalizacji na stałe
pt: Acesso ao local negado permanentemente
ru: Доступ к местоположению запрещен навсегда
tr: Konuma erişim kalıcı olarak reddedildi
uk: Відмовлено в доступі до місцезнаходження назавжди
zh: 永久拒绝访问位置

# allow_access_to_the_location_services_from_settings
source: Allow access to the location services for this App using the device settings.
ar: من فضلك قم بقبول إذن الوصول الي الموقع الجغرافي من إدادات التطبيق.
de: Erlaube den Zugriff auf den Standort über die Geräteeinstellungen.
es: Permita el acceso a los servicios de ubicación para esta aplicación usando la configuración del dispositivo.
fr: Autorisez l'accès aux services de localisation pour cette application à l'aide des paramètres de l'appareil.
it: Consenti l'accesso ai servizi di localizzazione per questa app utilizzando le impostazioni del dispositivo.
pl: Zezwól na dostęp do usług lokalizacyjnych dla tej aplikacji, korzystając z ustawień urządzenia.
pt: Permita o acesso aos serviços de localização para este aplicativo usando as configurações do dispositivo.
ru: Разрешите доступ к службам определения местоположения для этого приложения в настройках устройства.
tr: Cihaz ayarlarını kullanarak bu Uygulama için konum hizmetlerine erişime izin verin.
uk: Дозвольте доступ до служб місцезнаходження для цього додатка, використовуючи налаштування пристрою.
zh: 允许使用设备设置访问此应用的位置服务

source: Ok
ar: حسنا
fr: D'accord
ru: ОК
sr: U redu
tr: Tamam
zh: 好的

source: Can't get current location
ar: لا يمكن الحصول علي الموقع الجغرافي الحالي
de: Standort kann nicht abgefragt werden.
es: No se puede obtener la ubicación actual
fr: Impossible d'obtenir l'emplacement actuel
it: Impossibile ottenere la posizione attuale
pl: Nie można uzyskać bieżącej lokalizacji
pt: Não é possível obter a localização atual
ru: Невозможно получить текущее местоположение
sr: Ne možemo da pristupimo Vašoj lokaciji, pokušajte ponovo
tr: Geçerli konum alınamıyor
uk: Не вдається отримати поточне місцезнаходження
zh: 无法获取当前位置

source: Please make sure you enable GPS and try again
ar: الرجاء التاكد من تفعيل الـGPS و المحاولة مرة أخري
de: Stelle sicher das GPS aktiviert ist und probier es nochmal
es: Asegúrese de habilitar el GPS y vuelva a intentarlo
fr: Veuillez vous assurer d'activer le GPS et de réessayer
it: Assicurati di aver attivato il GPS e prova di nuovo
pl: Upewnij się, że włączyłeś GPS i spróbuj ponownie
pt: Certifique-se de ativar o GPS e tente novamente
ru: Пожалуйста, убедитесь, что вы включили GPS и попробуйте снова
sr: Proverite da li ste omogućili GPS i pokušajte ponovo
tr: Lütfen GPS’i etkinleştirin ve tekrar deneyin.
uk: Будь ласка, переконайтеся, що ви включили GPS та спробуйте ще раз
zh: 请确保您启用 GPS 并重试

source: Search place
ar: إبحث بإسم المكان
de: Suche Ort
es: Buscar lugar
fr: Rechercher un lieu
it: Ricerca luogo
pl: Wyszukaj miejsce
pt: Pesquisar endereço
ru: Поиск места
sr: Pretraži
tr: Konum ara
uk: Пошук місця
zh: 搜索地点

source: Finding place...
ar: جاري البحث...
de: Finde Orte...
es: Buscando lugar ...
fr: En train de trouver un lieu...
it: Cercando il luogo...
pl: Wyszukiwanie miejsca...
sr: Pronalaženje mesta ...
tr: Yer aranıyor...
uk: Пошук місця...
zh: 找地方...

source: No result found
ar: لم يتم العثور على نتائج
de: Keine Ergebnisse
es: No se encontraron resultados
fr: Aucun résultat trouvé
it: Nessun risultato trovato
pl: Nie znaleziono wyników
sr: Nema rezultata
tr: Sonuç Bulunamadı
uk: Результати не знайдено
zh: 未找到结果

source: Unnamed place
ar: مكان بدون اسم
de: unbekannter Ort
es: Lugar sin nombre
fr: Luogo senza nome
it: Località senza nome
pl: Miejsce bez nazwy
pt: Lugar sem nome
ru: Место без названия
tr: Adsız yer
uk: Місце без назви
zh: 未命名的地方

# mobile_settings
source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
pl: Ustawienia
pt: Configurações
ru: Настройки
sr: Поставке
tr: Ayarlar
uk: Налаштування
zh: 设置

# location_denied_callback_msg
source: To use this feature, we require access to your location.
ar: لاستخدام هذه الميزة، نحن بحاجة إلى الوصول إلى موقعك.
de: Um diese Funktion zu nutzen, benötigen wir Zugriff auf Ihren Standort.
es: Para utilizar esta función, necesitamos acceso a tu ubicación.
fr: Pour utiliser cette fonctionnalité, nous avons besoin d'accéder à votre emplacement.
it: Per utilizzare questa funzione, abbiamo bisogno dell'accesso alla tua posizione.
pl: Aby skorzystać z tej funkcji, wymagamy dostępu do Twojej lokalizacji.
pt: Para usar esta funcionalidade, precisamos de acesso à sua localização.
ru: Для использования этой функции нам нужен доступ к вашему местоположению.
sr: Да бисте користили ову функцију, потребан нам је приступ вашој локацији.
tr: Bu özelliği kullanmak için konumunuza erişim gerekiyor.
uk: Для використання цієї функції нам потрібен доступ до вашого місцезнаходження.
zh: 为了使用此功能，我们需要访问您的位置。

# location_permanently_denied_callback_msg
source: Location access is permanently denied. To enable this feature, go to your device settings and grant location permission.
ar: تم رفض وصول الموقع بشكل دائم. لتمكين هذه الميزة، انتقل إلى إعدادات جهازك وامنح إذن الوصول إلى الموقع.
de: Der Zugriff auf den Standort wurde dauerhaft verweigert. Um diese Funktion zu aktivieren, gehen Sie zu den Einstellungen Ihres Geräts und gewähren Sie die Standortberechtigung.
es: El acceso a la ubicación se ha denegado de forma permanente. Para habilitar esta función, ve a la configuración de tu dispositivo y concede permisos de ubicación.
fr: L'accès à l'emplacement est définitivement refusé. Pour activer cette fonctionnalité, rendez-vous dans les paramètres de votre appareil et accordez les autorisations d'emplacement.
it: L'accesso alla posizione è stato permanentemente negato. Per abilitare questa funzione, vai nelle impostazioni del tuo dispositivo e concedi il permesso di posizione.
pl: Dostęp do lokalizacji jest trwale zablokowany. Aby włączyć tę funkcję, przejdź do ustawień urządzenia i udziel zgody na lokalizację.
pt: O acesso à localização foi permanentemente negado. Para ativar esta funcionalidade, vá para as configurações do seu dispositivo e conceda permissão de localização.
ru: Доступ к местоположению запрещен навсегда. Чтобы включить эту функцию, перейдите в настройки вашего устройства и предоставьте разрешение на местоположение.
sr: Приступ локацији трајно је одбијен. Да бисте омогућили ову функцију, идите у подешавања вашег уређаја и доделите дозволу за локацију.
tr: Konum erişimi kalıcı olarak reddedildi. Bu özelliği etkinleştirmek için cihaz ayarlarına gidin ve konum izni verin.
uk: Доступ до місцезнаходження назавжди відмовлено. Щоб увімкнути цю функцію, перейдіть до налаштувань вашого пристрою та дайте дозвіл на місцезнаходження.
zh: 位置访问已被永久拒绝。要启用此功能，请转到您设备的设置并授予位置权限。

# location_restricted_callback_msg
source: Location access is restricted. To use this feature, ensure that your device's location settings are configured to allow access.
ar: تم تقييد وصول الموقع. لاستخدام هذه الميزة، تأكد من إعدادات الموقع على جهازك للسماح بالوصول.
de: Der Zugriff auf den Standort ist eingeschränkt. Um diese Funktion zu nutzen, stellen Sie sicher, dass die Standorteinstellungen auf Ihrem Gerät so konfiguriert sind, dass der Zugriff erlaubt ist.
es: El acceso a la ubicación está restringido. Para utilizar esta función, asegúrate de que la configuración de ubicación de tu dispositivo permita el acceso.
fr: L'accès à l'emplacement est restreint. Pour utiliser cette fonctionnalité, assurez-vous que les paramètres de localisation de votre appareil autorisent l'accès.
it: L'accesso alla posizione è limitato. Per utilizzare questa funzione, assicurati che le impostazioni di localizzazione del tuo dispositivo consentano l'accesso.
pl: Dostęp do lokalizacji jest ograniczony. Aby skorzystać z tej funkcji, upewnij się, że ustawienia lokalizacji Twojego urządzenia pozwalają na dostęp.
pt: O acesso à localização está restrito. Para usar esta funcionalidade, certifique-se de que as configurações de localização do seu dispositivo permitam o acesso.
ru: Доступ к местоположению ограничен. Чтобы использовать эту функцию, убедитесь, что настройки местоположения вашего устройства разрешают доступ.
sr: Приступ локацији је ограничен. Да бисте користили ову функцију, проверите да ли су поставке локације вашег уређаја конфигурисане да омогуће приступ.
tr: Konum erişimi sınırlıdır. Bu özelliği kullanmak için cihazınızın konum ayarlarının erişime izin verildiğinden emin olun.
uk: Доступ до місцезнаходження обмежений. Для використання цієї функції переконайтеся, що налаштування місцезнаходження вашого пристрою налаштовані на дозвіл доступу.
zh: 位置访问受限。要使用此功能，请确保您设备的位置设置配置允许访问。

# location_limited_callback_msg
source: Location access is limited. To use this feature fully, consider updating your location settings.
ar: تم تحديد وصول الموقع. لاستخدام هذه الميزة بشكل كامل، يُفضل تحديث إعدادات الموقع.
de: Der Zugriff auf den Standort ist begrenzt. Um diese Funktion vollständig zu nutzen, erwägen Sie eine Aktualisierung Ihrer Standorteinstellungen.
es: El acceso a la ubicación está limitado. Para utilizar completamente esta función, considera actualizar la configuración de ubicación.
fr: L'accès à l'emplacement est limité. Pour utiliser pleinement cette fonctionnalité, envisagez de mettre à jour les paramètres de localisation.
it: L'accesso alla posizione è limitato. Per utilizzare appieno questa funzione, considera di aggiornare le impostazioni di localizzazione.
pl: Dostęp do lokalizacji jest ograniczony. Aby pełni korzystać z tej funkcji, rozważ aktualizację ustawień lokalizacyjnych.
pt: O acesso à localização é limitado. Para usar completamente esta funcionalidade, considere atualizar as configurações de localização.
ru: Доступ к местоположению ограничен. Чтобы полностью использовать эту функцию, рассмотрите возможность обновления настроек местоположения.
sr: Приступ локацији је ограничен. Да бисте потпуно користили ову функцију, размислите о ажурирању поставки локације.
tr: Konum erişimi sınırlıdır. Bu özelliği tam anlamıyla kullanmak için konum ayarlarınızı güncellemeyi düşünün.
uk: Доступ до місцезнаходження обмежений. Щоб повністю використовувати цю функцію, розгляньте можливість оновлення налаштувань місцезнаходження.
zh: 位置访问受限。要充分使用此功能，请考虑更新您的位置设置。
